Ran Plan for project: `terraform-github` dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.repositories.module.terraform-minio.github_branch_default.repo will be created
+ resource "github_branch_default" "repo" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       rename     = false
+       repository = "terraform-minio"
    }

  # module.repositories.module.terraform-minio.github_branch_protection.default will be created
+ resource "github_branch_protection" "default" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = true
+       id                              = (known after apply)
+       lock_branch                     = false
+       pattern                         = "main"
+       repository_id                   = "terraform-minio"
+       require_conversation_resolution = true
+       require_signed_commits          = true
+       required_linear_history         = false

+       required_status_checks {
+           strict = true
        }
    }

  # module.repositories.module.terraform-minio.github_repository.repo will be created
+ resource "github_repository" "repo" {
+       allow_auto_merge            = false
+       allow_merge_commit          = true
+       allow_rebase_merge          = true
+       allow_squash_merge          = true
+       archive_on_destroy          = true
+       archived                    = false
+       auto_init                   = true
+       default_branch              = (known after apply)
+       delete_branch_on_merge      = true
+       description                 = "IaC for the MinIO S3 server with Terraform"
+       etag                        = (known after apply)
+       full_name                   = (known after apply)
+       git_clone_url               = (known after apply)
+       has_discussions             = false
+       has_downloads               = false
+       has_issues                  = true
+       has_projects                = false
+       has_wiki                    = false
+       homepage_url                = "https://minio.techtales.io"
+       html_url                    = (known after apply)
+       http_clone_url              = (known after apply)
+       id                          = (known after apply)
+       is_template                 = false
+       merge_commit_message        = "PR_TITLE"
+       merge_commit_title          = "MERGE_MESSAGE"
+       name                        = "terraform-minio"
+       node_id                     = (known after apply)
+       primary_language            = (known after apply)
+       private                     = (known after apply)
+       repo_id                     = (known after apply)
+       squash_merge_commit_message = "COMMIT_MESSAGES"
+       squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
+       ssh_clone_url               = (known after apply)
+       svn_url                     = (known after apply)
+       topics                      = [
+           "gitops",
+           "iac",
+           "infrastructure-as-code",
+           "minio",
+           "s3",
+           "terraform",
        ]
+       visibility                  = "public"
+       vulnerability_alerts        = true
+       web_commit_signoff_required = false
    }

  # module.repositories.module.terraform-minio.github_repository_webhook.atlantis will be created
+ resource "github_repository_webhook" "atlantis" {
+       active     = true
+       etag       = (known after apply)
+       events     = [
+           "issue_comment",
+           "pull_request",
+           "pull_request_review",
+           "push",
        ]
+       id         = (known after apply)
+       repository = "terraform-minio"
+       url        = (known after apply)

+       configuration {
+           content_type = "json"
+           insecure_ssl = false
+           secret       = (sensitive value)
+           url          = (sensitive value)
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p terraform-github`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.techtales.io/lock?id=techtales-io%252Fterraform-github%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p terraform-github`
</details>
Plan: 4 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`